//Задача 25: Напишите цикл, который принимает на вход 
//два числа (A и B) и возводит число A в натуральную степень B.
//3, 5 -> 243 (3⁵)
//2, 4 -> 16

Console.Write($"Введите первое число: ");
double N1 = Convert.ToInt32(Console.ReadLine());
Console.Write($"Введите второе число: ");
double N2 = Convert.ToInt32(Console.ReadLine());
double master = Math.Pow((double)N1, (double)N2);
double result = Math.Pow((double)N1, (double)N2);
Console.Write (result); 
{
    result = Math.Pow((double)N1, (double)N2);
    return; 
}; 






